ec2-galera/old/vanilla-mysql-standalone/add_2_3600.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            826364
        write:                           295130
        other:                           118052
        total:                           1239546
    transactions:                        59026  (16.40 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 1121494 (311.51 per sec.)
    other operations:                    118052 (32.79 per sec.)

Test execution summary:
    total time:                          3600.1920s
    total number of events:              59026
    total time taken by event execution: 7199.7801
    per-request statistics:
         min:                                 27.88ms
         avg:                                121.98ms
         max:                                941.65ms
         approx.  95 percentile:             265.51ms

Threads fairness:
    events (avg/stddev):           29513.0000/48.00
    execution time (avg/stddev):   3599.8901/0.01